
<?php

return [
    'password_confirm' => [
        'heading' => 'ยืนยันรหัสผ่าน',
        'description' => 'กรุณายืนยันรหัสผ่านของคุณเพื่อดำเนินการนี้',
        'current_password' => 'รหัสผ่านปัจจุบัน',
    ],
    'two_factor' => [
        'heading' => 'ท้าทายการยืนยันตัวตนสองชั้น',
        'description' => 'กรุณายืนยันการเข้าถึงบัญชีของคุณโดยป้อนรหัสที่แอปพลิเคชันสำหรับการรับรองความถูกต้องของคุณแสดง',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'การยืนยันตัวตนสองชั้น',
            'description' => 'กรุณายืนยันการเข้าถึงบัญชีของคุณโดยป้อนรหัสกู้คืนฉุกเฉินของคุณ',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'อุปกรณ์หาย?',
        'recovery_code_link' => 'ใช้รหัสกู้คืน',
        'back_to_login_link' => 'กลับไปยังหน้าเข้าสู่ระบบ',
    ],
    'profile' => [
        'account' => 'บัญชี',
        'profile' => 'โปรไฟล์',
        'my_profile' => 'โปรไฟล์ของฉัน',
        'subheading' => 'จัดการโปรไฟล์ผู้ใช้ของคุณที่นี่',
        'personal_info' => [
            'heading' => 'ข้อมูลส่วนตัว',
            'subheading' => 'จัดการข้อมูลส่วนตัวของคุณ',
            'submit' => [
                'label' => 'ปรับปรุง',
            ],
            'notify' => 'อัปเดตข้อมูลส่วนตัวสำเร็จ!',
        ],
        'password' => [
            'heading' => 'รหัสผ่าน',
            'subheading' => 'ต้องมีความยาวอย่างน้อย 8 ตัวอักษร',
            'submit' => [
                'label' => 'ปรับปรุง',
            ],
            'notify' => 'อัปเดตรหัสผ่านสำเร็จ!',
        ],
        '2fa' => [
            'title' => 'การยืนยันตัวตนสองชั้น',
            'description' => 'จัดการการยืนยันตัวตนสองชั้นสำหรับบัญชีของคุณ (แนะนำ)',
            'actions' => [
                'enable' => 'เปิดใช้งาน',
                'regenerate_codes' => 'สร้างรหัสกู้คืนใหม่',
                'disable' => 'ปิดใช้งาน',
                'confirm_finish' => 'ยืนยันและดำเนินการต่อ',
                'cancel_setup' => 'ยกเลิกการตั้งค่า',
            ],
            'setup_key' => 'คีย์การตั้งค่า',
            'must_enable' => 'คุณต้องเปิดใช้งานการยืนยันตัวตนสองชั้นเพื่อใช้แอปพลิเคชันนี้',
            'not_enabled' => [
                'title' => 'คุณยังไม่ได้เปิดใช้งานการยืนยันตัวตนสองชั้น',
                'description' => 'เมื่อเปิดใช้งานการยืนยันตัวตนสองชั้น ระบบจะแจ้งขอโทเค็นสุ่มแบบปลอดภัยระหว่างการรับรองความถูกต้อง คุณสามารถดึงโทเค็นนี้จากแอปพลิเคชัน Google Authenticator บนโทรศัพท์ของคุณได้',
            ],
            'finish_enabling' => [
                'title' => 'ดำเนินการเปิดใช้งานการยืนยันตัวตนสองชั้น',
                'description' => 'เพื่อดำเนินการเปิดใช้งานการยืนยันตัวตนสองชั้น สแกนคิวอาร์โค้ดต่อไปนี้โดยใช้แอปพลิเคชันสำหรับการรับรองความถูกต้องบนโทรศัพท์ของคุณ หรือป้อนคีย์การตั้งค่าและระบุรหัส OTP ที่สร้างขึ้น',
            ],
            'enabled' => [
                'notify' => 'เปิดใช้งานการยืนยันตัวตนสองชั้นแล้ว',
                'title' => 'คุณได้เปิดใช้งานการยืนยันตัวตนสองชั้นแล้ว!',
                'description' => 'การยืนยันตัวตนสองชั้นเปิดใช้งานอยู่แล้ว ซึ่งช่วยเพิ่มความปลอดภัยให้แก่บัญชีของคุณ',
                'store_codes' => 'คุณสามารถใช้รหัสเหล่านี้เพื่อกู้คืนการเข้าถึงบัญชีของคุณกรณีอุปกรณ์สูญหาย คำเตือน! รหัสเหล่านี้จะแสดงเพียงครั้งเดียวเท่านั้น',
            ],
            'disabling' => [
                'notify' => 'ได้ปิดใช้งานการยืนยันตัวตนสองชั้นแล้ว',
            ],
            'regenerate_codes' => [
                'notify' => 'สร้างรหัสกู้คืนใหม่เรียบร้อยแล้ว',
            ],
            'confirmation' => [
                'success_notification' => 'รหัสผ่านยืนยันถูกต้อง เปิดใช้งานการยืนยันตัวตนสองชั้นแล้ว',
                'invalid_code' => 'รหัสที่คุณป้อนไม่ถูกต้อง',
            ],
        ],
        'sanctum' => [
            'title' => 'API Token',
            'description' => 'จัดการ API Token ที่อนุญาตให้บริการของบุคคลที่สามเข้าถึงแอปพลิเคชันนี้ในนามของคุณ',
            'create' => [
                'notify' => 'สร้าง Token สำเร็จ!',
                'message' => 'Token ของคุณจะแสดงเพียงครั้งเดียวเท่านั้นเมื่อสร้าง หากคุณทำ Token หาย คุณจะต้องลบและสร้างใหม่',
                'submit' => [
                    'label' => 'สร้าง API Token',
                ],
            ],
            'update' => [
                'notify' => 'อัปเดต Token สำเร็จ!',
            ],
            'copied' => [
                'label' => 'ฉันได้คัดลอก Token ของฉันแล้ว',
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'คัดลอกไปยังคลิปบอร์ด',
        'tooltip' => 'คัดลอกแล้ว!',
    ],
    'fields' => [
        'avatar' => 'รูปประจำตัว',
        'email' => 'อีเมล',
        'login' => 'เข้าสู่ระบบ',
        'name' => 'ชื่อ',
        'password' => 'รหัสผ่าน',
        'password_confirm' => 'ยืนยันรหัสผ่าน',
        'new_password' => 'รหัสผ่านใหม่',
        'new_password_confirmation' => 'ยืนยันรหัสผ่านใหม่',
        'token_name' => 'ชื่อ Token',
        'token_expiry' => 'วันหมดอายุของ Token',
        'abilities' => 'ความสามารถ',
        '2fa_code' => 'รหัส',
        '2fa_recovery_code' => 'รหัสกู้คืน',
        'created' => 'สร้างเมื่อ',
        'expires' => 'วันหมดอายุ',
    ],
    'or' => 'หรือ',
    'cancel' => 'ยกเลิก',
];
