<?php

return [

    'single' => [

        'label' => 'ยกเลิกการเชื่อมความสัมพันธ์',

        'modal' => [

            'heading' => 'ยกเลิกการเชื่อมความสัมพันธ์ :label',

            'actions' => [

                'dissociate' => [
                    'label' => 'ยกเลิกการเชื่อมความสัมพันธ์',
                ],

            ],

        ],

        'notifications' => [

            'dissociated' => [
                'title' => 'ยกเลิกการเชื่อมความสัมพันธ์สำเร็จ',
            ],

        ],

    ],

    'multiple' => [

        'label' => 'ยกเลิกการเชื่อมความสัมพันธ์รายการที่เลือก',

        'modal' => [

            'heading' => 'ยกเลิกการเชื่อมความสัมพันธ์ :label ที่เลือก',

            'actions' => [

                'dissociate' => [
                    'label' => 'ยกเลิกการเชื่อมความสัมพันธ์',
                ],

            ],

        ],

        'notifications' => [

            'dissociated' => [
                'title' => 'ยกเลิกการเชื่อมความสัมพันธ์สำเร็จ',
            ],

        ],

    ],

];
